/*
    总任务：进入腾讯云或者腾讯医疗岗位时间为7月份至8月份 初步 2021年7月1日
    当前时间：20201217
    剩余时间：197天

    任务拆解：
            简历
            项目：
                用react写一个页面生成器，包含错误上报，页面性能监控，访问量监控
            算法
            vue
                vue源码
            javascript
            html
            css
            浏览器
            安全
            性能优化
            性能监控
            react
            node
            webpack

    计划安排：
		
		周一 至 周五
			8点半-10点 工作
			10点-11点 算法
			11点-12点 造轮子
			1点-2点半 工作
			2点半-4点半 webpack、vita、浏览器原理、线程与进程、手写代码、浏览器安全
			4点半-5点半 代码优化
		
		周六 周日
			9点-11点 vue源码
			11点-12点 算法
			3点-5点半 造轮子 
			
			vue源码 7-9点半
			算法 9半-10点半
			node 10半-11点半
			11点半-12点半 造轮子
		
		周六
		
 */
