/*
    总任务：进入腾讯云或者腾讯医疗岗位时间为7月份至8月份 初步 2021年7月1日
    当前时间：20201217
    剩余时间：197天

    任务拆解：
            简历
            项目：
                用react写一个页面生成器，包含错误上报，页面性能监控，访问量监控
            算法
            vue
                vue源码
            javascript
            html
            css
            浏览器
            安全
            性能优化
            性能监控
            react
            node
            webpack

    计划安排：

		周一 至 周五
			8点半-10点 工作
			10点-11点 算法
			11点-12点 造轮子
			1点-2点半 工作
			2点半-4点半 webpack、vita、浏览器原理、线程与进程、手写代码、浏览器安全
			4点半-5点半 代码优化

		周六 周日
			9点-11点 vue源码
			11点-12点 算法
			3点-5点半 造轮子

			vue源码 7-9点半
			算法 9半-10点半
			node 10半-11点半
			11点半-12点半 造轮子

	计划任务：
	        造轮子-vue核心原理
	        造轮子-axios
	            1.看源码，熟悉源码
	            2.思考优缺点
	            3.是否能改进
	            4.手写源码
	        造轮子-vuex
	            1.看源码，熟悉源码
	            2.思考优缺点
	            3.是否能改进
	             4.手写源码
	        造轮子-vue-router
	            1.看源码，熟悉源码
	            2.思考优缺点
	            3.是否能改进
	            4.手写源码
	        造轮子-webpack
	            1.看源码，熟悉源码
	            2.思考优缺点
	            3.是否能改进
	            4.手写源码

 */


20210209 安排
1.取水果
2.拿快递
3.取钱
4.收衣服
5.红包纸

20210210 安排
1.洗车
2.拿快递
3.

红包
妈：1000
爸：1000
爷爷：800
奶奶：800
谭谭爸：1000
谭谭妈：1000
谭谭侄子：400 谭谭侄女：400
李超子：200 丽君子：200 玲姐姐子：200
姐：800 姐夫：800
8600

谭谭：1680

11000
6000

5000

4700


