// 1． 第一个记忆周期：5分钟
// 2． 第二个记忆周期：30分钟 20201217 19:30
// 3． 第三个记忆周期：12小时 20201218 07:00
// 4． 第四个记忆周期：1天 20201218 19:00
// 5． 第五个记忆周期：2天 20201219 19:00
// 6． 第六个记忆周期：4天 20201221 19:00
// 7． 第七个记忆周期：7天 20201224 19:00
// 8． 第八个记忆周期：15天 20210102 19:00

/*
 * 基础
 *      self 指什么？ 20:07
 *          self 代指 window对象
 *
 *      Object.freeze 是干什么的？ 20:08
 *          冻结一个对象的值 属性 和原型
 *
 *      null和undefined的区别？ 20:12
 *          null表示没有对象，即该处不应该有值
 *          1.作为函数的参数，表示该函数不是对象
 *          2.作为对象原型链的终点
 *          undefined表示缺少值，即此处应该有值，但没有定义
 *          1.定义了形参，没有传实参，显示undefined
 *          2.对象属性名不存在时，显示undefined
 *          3.函数没有写返回值，即没有写return 拿到的是undefined
 *          4.写了return，但没有赋值，拿到的是undefined
 *          null和undefined转换成number数据类型
 *          null默认转成0
 */
